In [1]:
import pandas as pd
import numpy as np
import re

In [2]:
df1 = pd.read_csv(r'C:/Users/OMKAR/Desktop/Practice/KPMG/Uncleaned/CustomersDemographics.csv')
df2 = pd.read_csv(r'C:/Users/OMKAR/Desktop/Practice/KPMG/Uncleaned/CustomersAddress.csv')
df3 = pd.read_csv(r'C:/Users/OMKAR/Desktop/Practice/KPMG/Uncleaned/NewCustomersList.csv')

In [3]:
df1.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
0,1,Laraine,Medendorp,F,93,12-10-1953,Executive Secretary,Health,Mass Customer,N,"""'",Yes,11.0
1,2,Eli,Bockman,Male,81,16-12-1980,Administrative Officer,Financial Services,Mass Customer,N,<script>alert('hi')</script>,Yes,16.0
2,3,Arlin,Dearle,Male,61,20-01-1954,Recruiting Manager,Property,Mass Customer,N,01-Feb,Yes,15.0
3,4,Talbot,NaN,Male,33,03-10-1961,NaN,IT,Mass Customer,N,() { _; } >_[$($())] { touch /tmp/blns.shellsh...,No,7.0
4,5,Sheila-kathryn,Calton,Female,56,13-05-1977,Senior Editor,NaN,Affluent Customer,N,NIL,Yes,8.0

In [4]:
df2.head()

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

### Exploring Customer Demographics table

In [5]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 13 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   customer_id                          4000 non-null   int64
 1   first_name                           4000 non-null   object
 2   last_name                            3875 non-null   object
 3   gender                               4000 non-null   object
 4   past_3_years_bike_related_purchases  4000 non-null   int64
 5   DOB                                  3913 non-null   object
 6   job_title                            3494 non-null   object
 7   job_industry_category                3344 non-null   object
 8   wealth_segment                       4000 non-null   object
 9   deceased_indicator                   4000 non-null   object
 10  default                              3698 non-null   object
 11  owns_car                             4000 non-null   object
 12  tenure                               3913 non-null   float64
dtypes: float64(1), int64(2), object(10)
memory usage: 406.4+ KB

In [6]:
##checking for null values
df1.isnull().sum()

customer_id                              0
first_name                               0
last_name                              125
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     87
job_title                              506
job_industry_category                  656
wealth_segment                           0
deceased_indicator                       0
default                                302
owns_car                                 0
tenure                                  87
dtype: int64

In [7]:
##checking for duplicate values
df1.duplicated().sum()

0

In [8]:
##checking for unique values
df1.nunique()

customer_id                            4000
first_name                             3139
last_name                              3725
gender                                    6
past_3_years_bike_related_purchases     100
DOB                                    3448
job_title                               195
job_industry_category                     9
wealth_segment                            3
deceased_indicator                        2
default                                 101
owns_car                                  2
tenure                                   22
dtype: int64

### Exploring CustomerDemographics columns

In [9]:
df1.columns

Index(['customer_id', 'first_name', 'last_name', 'gender',
       'past_3_years_bike_related_purchases', 'DOB', 'job_title',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'default', 'owns_car', 'tenure'],
      dtype='object')

In [10]:
df1['last_name'] = df1['last_name'].fillna('not recorded')

In [11]:
df1['gender'].value_counts()

Female    2037
Male      1872
U           88
F            1
Femal        1
M            1
Name: gender, dtype: int64

In [12]:
## replacing irrelevant Gender values into common values
df1['gender'] = df1['gender'].replace('F', 'Female').replace('Femal','Female').replace('M','Male').replace('U','Unspecified')

In [13]:
df1['gender'].value_counts()

Female         2039
Male           1873
Unspecified      88
Name: gender, dtype: int64

In [14]:

df1['past_3_years_bike_related_purchases']

0       93
1       81
2       61
3       33
4       56
        ..
3995     8
3996    87
3997    60
3998    11
3999    76
Name: past_3_years_bike_related_purchases, Length: 4000, dtype: int64

In [15]:
df1['DOB'].isnull().sum()

87

In [16]:
### Converting Object Datatype to Datetime Datatype
df1['DOB'] = pd.to_datetime(df1['DOB'])

In [17]:
### Filling null values with relevant values
df1['DOB'] = df1['DOB'].fillna('not recorded')

In [18]:
df1['DOB'].value_counts()

not recorded           87
1978-01-30 00:00:00     7
1962-12-17 00:00:00     4
1977-05-13 00:00:00     4
1976-07-16 00:00:00     4
                       ..
1989-06-16 00:00:00     1
1998-09-30 00:00:00     1
1985-11-03 00:00:00     1
1989-10-23 00:00:00     1
1991-05-11 00:00:00     1
Name: DOB, Length: 3449, dtype: int64

In [19]:
df1['job_title'].value_counts()

Business Systems Development Analyst    45
Tax Accountant                          44
Social Worker                           44
Internal Auditor                        42
Recruiting Manager                      41
                                        ..
Database Administrator I                 4
Health Coach I                           3
Health Coach III                         3
Research Assistant III                   3
Developer I                              1
Name: job_title, Length: 195, dtype: int64

In [20]:
## Changing datatype 
df1['job_title'] = df1['job_title'].astype('object')

In [21]:
df1['job_title']

0          Executive Secretary
1       Administrative Officer
2           Recruiting Manager
3                          NaN
4                Senior Editor
                 ...
3995     VP Product Management
3996           Statistician II
3997         Assistant Manager
3998                       NaN
3999      Software Engineer IV
Name: job_title, Length: 4000, dtype: object

In [22]:
df1['job_title'] = df1['job_title'].fillna('not recorded')

In [23]:
df1['job_industry_category']

0                   Health
1       Financial Services
2                 Property
3                       IT
4                      NaN
               ...
3995                Health
3996         Manufacturing
3997                    IT
3998         Manufacturing
3999                   NaN
Name: job_industry_category, Length: 4000, dtype: object

In [24]:
df1['job_industry_category'].value_counts()

Manufacturing         799
Financial Services    774
Health                602
Retail                358
Property              267
IT                    223
Entertainment         136
Argiculture           113
Telecommunications     72
Name: job_industry_category, dtype: int64

In [25]:
#Correcting typos
df1['job_industry_category'] = df1['job_industry_category'].replace('Argiculture','Agriculture')

In [26]:
df1['job_industry_category'].value_counts()

Manufacturing         799
Financial Services    774
Health                602
Retail                358
Property              267
IT                    223
Entertainment         136
Agriculture           113
Telecommunications     72
Name: job_industry_category, dtype: int64

In [27]:
df1['job_industry_category'] = df1['job_industry_category'].fillna('not recorded')

In [28]:
df1['wealth_segment']

0           Mass Customer
1           Mass Customer
2           Mass Customer
3           Mass Customer
4       Affluent Customer
              ...
3995        Mass Customer
3996       High Net Worth
3997       High Net Worth
3998    Affluent Customer
3999    Affluent Customer
Name: wealth_segment, Length: 4000, dtype: object

In [29]:
df1['wealth_segment'].value_counts()

Mass Customer        2000
High Net Worth       1021
Affluent Customer     979
Name: wealth_segment, dtype: int64

In [30]:
df1['deceased_indicator']

0       N
1       N
2       N
3       N
4       N
       ..
3995    N
3996    N
3997    N
3998    N
3999    N
Name: deceased_indicator, Length: 4000, dtype: object

In [31]:
df1['deceased_indicator'].value_counts()

N    3998
Y       2
Name: deceased_indicator, dtype: int64

In [32]:
df1['deceased_indicator'] = df1['deceased_indicator'].replace('N','Non Deceased').replace('Y','Deceased')

In [33]:
df1['deceased_indicator'].value_counts()

Non Deceased    3998
Deceased           2
Name: deceased_indicator, dtype: int64

In [34]:
df1['default']

0                                                      "'
1                            <script>alert('hi')</script>
2                                                  01-Feb
3       () { _; } >_[$($())] { touch /tmp/blns.shellsh...
4                                                     NIL
                              ...
3995                                            -1.00E+02
3996                                             â¦testâ§
3997                                                  NaN
3998                               Â¡â¢Â£Â¢âÂ§Â¶â¢ÂªÂºââ
3999                                                  0/0
Name: default, Length: 4000, dtype: object

In [35]:
##droping default column
df1.drop('default', axis = 1, inplace = True)

In [36]:
df1['owns_car']

0       Yes
1       Yes
2       Yes
3        No
4       Yes
       ...
3995     No
3996    Yes
3997     No
3998    Yes
3999     No
Name: owns_car, Length: 4000, dtype: object

In [37]:
df1['owns_car'].value_counts()

Yes    2024
No     1976
Name: owns_car, dtype: int64

In [38]:
df1['tenure']

0       11.0
1       16.0
2       15.0
3        7.0
4        8.0
        ...
3995    19.0
3996     1.0
3997     NaN
3998    10.0
3999    11.0
Name: tenure, Length: 4000, dtype: float64

In [39]:
df1['tenure'].isnull().sum()

87

In [40]:
df1['tenure'].value_counts()

7.0     235
5.0     228
11.0    221
10.0    218
16.0    215
8.0     211
18.0    208
12.0    202
9.0     200
14.0    200
6.0     192
13.0    191
4.0     191
17.0    182
15.0    179
1.0     166
3.0     160
19.0    159
2.0     150
20.0     96
22.0     55
21.0     54
Name: tenure, dtype: int64

In [41]:
## deleting an entry with wrong DOB
df1 = df1[df1.customer_id != 34]

In [42]:
df1.to_csv('C:/Users/OMKAR/Desktop/Practice/KPMG/Cleaned/CustomerDemographics.csv', index = False)

## Exploring CustomersAddress table

In [43]:
df2.head()

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [44]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3999 entries, 0 to 3998
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   customer_id         3999 non-null   int64
 1   address             3999 non-null   object
 2   postcode            3999 non-null   int64
 3   state               3999 non-null   object
 4   country             3999 non-null   object
 5   property_valuation  3999 non-null   int64
dtypes: int64(3), object(3)
memory usage: 187.6+ KB

In [45]:
df2.isnull().sum()

customer_id           0
address               0
postcode              0
state                 0
country               0
property_valuation    0
dtype: int64

In [46]:
## Checking for duplicate values
df2.duplicated().sum()

0

In [47]:
## Checking for unique values
df2.nunique()

customer_id           3999
address               3996
postcode               873
state                    5
country                  1
property_valuation      12
dtype: int64

### Exploring Columns

In [48]:
df2.columns

Index(['customer_id', 'address', 'postcode', 'state', 'country',
       'property_valuation'],
      dtype='object')

In [49]:
df2['address'].value_counts()

3 Mariners Cove Terrace      2
3 Talisman Place             2
64 Macpherson Junction       2
359 Briar Crest Road         1
4543 Service Terrace         1
                            ..
5063 Shopko Pass             1
09 Hagan Pass                1
87897 Lighthouse Bay Pass    1
294 Lawn Junction            1
320 Acker Drive              1
Name: address, Length: 3996, dtype: int64

In [50]:
df2['postcode'].unique()

array([2016, 2153, 4211, 2448, 3216, 2210, 2650, 2023, 3044, 4557, 3799,
       2760, 2428, 3331, 3058, 2135, 2233, 2444, 4413, 4740, 3218, 4868,
       4116, 2519, 2756, 2170, 4005, 4127, 2535, 4726, 4805, 2212, 2207,
       3350, 3931, 4018, 4670, 2480, 3212, 2322, 3198, 2047, 4503, 2145,
       4350, 2142, 2029, 2127, 4280, 2166, 2046, 2026, 2765, 2749, 2745,
       3752, 2217, 2230, 3046, 3183, 2070, 2213, 4208, 2774, 4133, 4213,
       4170, 2073, 3561, 2330, 3977, 2204, 2086, 2226, 2075, 2038, 2069,
       2100, 3133, 3070, 2777, 2125, 2766, 2209, 2160, 2065, 2150, 2168,
       4171, 2155, 2517, 2096, 2750, 2093, 3204, 4300, 3844, 4226, 3192,
       2485, 2097, 4817, 2516, 3074, 4508, 4405, 2452, 2205, 4132, 4744,
       2158, 3201, 4178, 2112, 2033, 4401, 3186, 4017, 2315, 2285, 2219,
       4509, 2759, 2747, 2227, 2025, 3191, 3025, 2263, 2154, 2119, 3016,
       4113, 2032, 4352, 3020, 2116, 3057, 2099, 3749, 2148, 3145, 2021,
       2333, 2783, 2280, 4120, 3638, 2074, 2880, 2430, 4560, 2088, 2220,
       3031, 2250, 2261, 3196, 4680, 3143, 2063, 3021, 2138, 4811, 2085,
       3084, 3170, 2066, 4078, 2222, 3152, 2159, 4655, 4220, 4012, 2015,
       2776, 3011, 2761, 2502, 2110, 2566, 2506, 2508, 2036, 2018, 3666,
       4514, 2525, 4152, 2200, 3023, 3500, 2283, 2102, 2040, 2304, 2340,
       3580, 3355, 2287, 2324, 2323, 2320, 2346, 2031, 2064, 2176, 3195,
       2010, 2768, 2752, 3802, 3071, 4735, 3081, 3205, 2165, 3125, 4214,
       2030, 2767, 2798, 2117, 4551, 3064, 3810, 4151, 2830, 3030, 4812,
       2141, 3029, 2173, 3199, 4506, 2035, 3340, 3182, 2450, 2216, 3796,
       3197, 2232, 2365, 4701, 4210, 2223, 4122, 2515, 3437, 3338, 2203,
       3356, 3223, 3032, 3105, 3101, 2763, 2089, 2126, 2147, 2251, 3127,
       3087, 3131, 3134, 2193, 4055, 2530, 4217, 4020, 2179, 3130, 4570,
       3215, 3165, 3936, 2265, 3034, 2062, 2162, 3033, 2144, 3805, 2642,
       3228, 3444, 2076, 4124, 4305, 2579, 2835, 3337, 2536, 2770, 2646,
       4558, 2211, 2570, 4552, 3082, 2360, 4223, 4370, 3150, 2549, 3040,
       4209, 4173, 2068, 3806, 2259, 2260, 4074, 4215, 3008, 2748, 2567,
       3015, 4221, 3121, 4870, 2118, 2050, 2120, 3812, 3111, 3012, 2197,
       3162, 2037, 3141, 3178, 3564, 3550, 3775, 3004, 3185, 2447, 3910,
       3621, 4702, 2133, 3075, 3911, 2487, 4123, 2151, 3156, 3126, 2027,
       3124, 2564, 2049, 3690, 3282, 2576, 3108, 4165, 2218, 2190, 2337,
       2307, 2121, 2716, 3168, 3076, 2478, 2560, 2087, 4505, 2630, 2225,
       3013, 3136, 2111, 2106, 3930, 2291, 2305, 2300, 4179, 2539, 3207,
       4340, 3137, 3068, 4580, 2041, 4504, 2306, 4075, 3975, 4114, 4341,
       4022, 4820, 3028, 4035, 2326, 3429, 4218, 2380, 3171, 2565, 3850,
       3807, 4800, 2577, 2199, 2134, 4053, 2800, 2048, 2194, 2557, 2548,
       2262, 2463, 2481, 2072, 3155, 3095, 4207, 4110, 2017, 2769, 4562,
       2571, 3480, 3551, 2753, 3093, 4615, 3174, 2192, 2290, 3073, 4810,
       4121, 2229, 4118, 2594, 3750, 4019, 2540, 2293, 2143, 3630, 2164,
       4869, 2137, 2354, 4814, 2282, 2292, 2171, 2077, 4873, 4006, 2754,
       2152, 2067, 2122, 3976, 2000, 3175, 2156, 2228, 3187, 2680, 2527,
       2163, 2336, 4415, 3139, 3147, 3623, 4356, 2034, 2196, 2177, 2234,
       2537, 4720, 3765, 2486, 4511, 2795, 3188, 3730, 3060, 4131, 2518,
       3158, 2477, 2195, 2575, 3400, 3037, 4507, 2113, 2443, 3177, 2641,
       4212, 3241, 3428, 4227, 4034, 2558, 2460, 3173, 2289, 4500, 4825,
       4161, 3757, 2871, 2146, 4380, 3024, 3934, 3109, 2136, 2484, 3225,
       4068, 2214, 3809, 2454, 4556, 4573, 2131, 3184, 2619, 3138, 3441,
       2101, 4510, 2647, 2731, 3284, 2573, 2206, 4815, 2526, 4502, 2710,
       2090, 3038, 3142, 3442, 4064, 2529, 3039, 2061, 3644, 2104, 2044,
       3043, 2873, 2541, 2321, 2079, 3072, 2007, 2620, 2231, 2580, 2020,
       2852, 3677, 4818, 4519, 4806, 4610, 4512, 4306, 4304, 4301, 4205,
       4051, 4130, 4115, 4164, 4128, 3940, 3939, 3840, 3804, 2582, 3747,
       3620, 3151, 3380, 3280, 3224, 3222, 3226, 3190, 3169, 3163, 3161,
       3791, 4119, 3140, 3818, 3106, 3099, 3754, 3756, 3061, 3048, 3036,
       3107, 3022, 3049, 2870, 2762, 2794, 2773, 2640, 2439, 2528, 2440,
       2325, 2161, 2848, 4878, 2775, 2224, 3219, 2441, 4877, 3264, 2681,
       3018, 2043, 2107, 4567, 4011, 2221, 2028, 3941, 3146, 3585, 4105,
       2094, 2284, 3808, 3149, 3114, 3352, 3129, 4154, 2114, 4721, 2011,
       4157, 4799, 2095, 3103, 4224, 4344, 2009, 3144, 3181, 2665, 2474,
       3166, 2820, 4059, 4160, 3189, 4030, 2042, 4032, 4103, 2868, 2358,
       2449, 2299, 4014, 3056, 2281, 4007, 2318, 3821, 4109, 4216, 2470,
       2563, 2264, 2445, 4060, 3214, 4077, 2327, 4104, 3172, 2505, 2115,
       2469, 2705, 3088, 3966, 3912, 2446, 2810, 4061, 3083, 3915, 4153,
       2267, 3458, 4421, 3505, 3006, 4037, 3918, 2335, 3079, 2400, 3148,
       2092, 2714, 3555, 2008, 3631, 4228, 4101, 2022, 4568, 3115, 4343,
       3116, 2208, 4125, 4070, 3194, 2533, 2758, 4159, 4879, 2500, 2298,
       2178, 3240, 2671, 4455, 4650, 3160, 3250, 3342, 3523, 2350, 2785,
       3995, 3351, 3000, 2462, 3041, 3260, 2534, 4565, 3618, 2780, 2167,
       3279, 4106, 4700, 2799, 4564, 4860, 3922, 2256, 4031, 2779, 4660,
       4073, 3067, 2843, 3027, 3066, 2572, 2128, 4054, 4069, 2343, 3377,
       3065, 2295, 4270, 2316, 3179, 3933, 4883, 2081, 2471, 3053, 4285,
       2546, 4275, 3132, 3042, 3085, 2071, 2821, 4390, 3793, 3128, 2869,
       3616, 4750, 3059, 3153, 2130, 3213, 3862, 3610, 4102, 2060, 3786,
       2019, 2191, 2713, 3094, 3122, 2850, 4272, 3051, 3634, 3803, 4515,
       2700, 3123, 2294, 3978, 3305, 2198, 2778, 4730, 4155, 4000, 4225,
       3556, 4575, 4715, 2429, 4555, 2132, 2045, 2024, 4076, 3321, 3193,
       2390, 2806, 2257, 4172, 3078, 3104, 3860, 2658, 3052, 4163, 2590,
       2550, 2877, 4311, 3089], dtype=int64)

In [51]:
df2['state'].unique()

array(['New South Wales', 'QLD', 'VIC', 'NSW', 'Victoria'], dtype=object)

In [52]:
df2['state'].value_counts()

NSW                2054
VIC                 939
QLD                 838
New South Wales      86
Victoria             82
Name: state, dtype: int64

In [53]:
##Keeping all State names in common format
df2['state'] = df2['state'].replace('New South Wales', 'NSW').replace('Victoria', 'VIC').replace('Queensland', 'QLD')

In [54]:
df2['state'].value_counts()

NSW    2140
VIC    1021
QLD     838
Name: state, dtype: int64

In [55]:
df2['state'].isnull().sum()

0

In [56]:
df2['country'].unique()

array(['Australia'], dtype=object)

In [57]:
df2['country'].isnull().sum()

0

In [58]:
df2['property_valuation'].isnull().sum()

0

In [59]:
df2['property_valuation'].unique()

array([10,  9,  4, 12,  8,  6,  7,  3,  5, 11,  1,  2], dtype=int64)

In [60]:
df2['property_valuation'].value_counts()

9     647
8     646
10    577
7     493
11    281
6     238
5     225
4     214
12    195
3     186
1     154
2     143
Name: property_valuation, dtype: int64

In [61]:
df2.to_csv('C:/Users/OMKAR/Desktop/Practice/KPMG/Cleaned/CustomerAddress.csv', index = False)

## Exploring NewCustomersList Dataset

In [62]:
df3.head()

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,...,state,country,property_valuation,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Rank,Value
0,Chickie,Brister,Male,86,12-07-1957,General Manager,Manufacturing,Mass Customer,N,Yes,...,QLD,Australia,6,0.83,1.0375,1.296875,1.102344,1,1,1.718750
1,Morly,Genery,Male,69,22-03-1970,Structural Engineer,Property,Mass Customer,N,No,...,NSW,Australia,11,0.93,0.9300,1.162500,0.988125,1,1,1.718750
2,Ardelis,Forrester,Female,10,28-08-1974,Senior Cost Accountant,Financial Services,Affluent Customer,N,No,...,VIC,Australia,5,0.96,0.9600,0.960000,0.960000,1,1,1.718750
3,Lucine,Stutt,Female,64,28-01-1979,Account Representative III,Manufacturing,Affluent Customer,N,Yes,...,QLD,Australia,1,0.99,1.2375,1.237500,1.237500,4,4,1.703125
4,Melinda,Hadlee,Female,34,21-09-1965,Financial Analyst,Financial Services,Affluent Customer,N,No,...,NSW,Australia,9,0.72,0.7200,0.900000,0.900000,4,4,1.703125

In [63]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 23 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   first_name                           1000 non-null   object
 1   last_name                            971 non-null    object
 2   gender                               1000 non-null   object
 3   past_3_years_bike_related_purchases  1000 non-null   int64
 4   DOB                                  983 non-null    object
 5   job_title                            894 non-null    object
 6   job_industry_category                835 non-null    object
 7   wealth_segment                       1000 non-null   object
 8   deceased_indicator                   1000 non-null   object
 9   owns_car                             1000 non-null   object
 10  tenure                               1000 non-null   int64
 11  address                              1000 non-null   object
 12  postcode                             1000 non-null   int64
 13  state                                1000 non-null   object
 14  country                              1000 non-null   object
 15  property_valuation                   1000 non-null   int64
 16  Unnamed: 16                          1000 non-null   float64
 17  Unnamed: 17                          1000 non-null   float64
 18  Unnamed: 18                          1000 non-null   float64
 19  Unnamed: 19                          1000 non-null   float64
 20  Unnamed: 20                          1000 non-null   int64
 21  Rank                                 1000 non-null   int64
 22  Value                                1000 non-null   float64
dtypes: float64(5), int64(6), object(12)
memory usage: 179.8+ KB

In [64]:
df3.shape

(1000, 23)

In [65]:
df3.isnull().sum()

first_name                               0
last_name                               29
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     17
job_title                              106
job_industry_category                  165
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                   0
address                                  0
postcode                                 0
state                                    0
country                                  0
property_valuation                       0
Unnamed: 16                              0
Unnamed: 17                              0
Unnamed: 18                              0
Unnamed: 19                              0
Unnamed: 20                              0
Rank                                     0
Value                                    0
dtype: int64

In [66]:
df3.duplicated().sum()

0

In [67]:
df3.nunique()

first_name                              940
last_name                               961
gender                                    3
past_3_years_bike_related_purchases     100
DOB                                     958
job_title                               184
job_industry_category                     9
wealth_segment                            3
deceased_indicator                        1
owns_car                                  2
tenure                                   23
address                                1000
postcode                                522
state                                     3
country                                   1
property_valuation                       12
Unnamed: 16                              71
Unnamed: 17                             129
Unnamed: 18                             185
Unnamed: 19                             321
Unnamed: 20                             324
Rank                                    324
Value                                   319
dtype: int64

### Exploring columns

In [68]:



df3.columns

Index(['first_name', 'last_name', 'gender',
       'past_3_years_bike_related_purchases', 'DOB', 'job_title',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'owns_car', 'tenure', 'address', 'postcode', 'state', 'country',
       'property_valuation', 'Unnamed: 16', 'Unnamed: 17', 'Unnamed: 18',
       'Unnamed: 19', 'Unnamed: 20', 'Rank', 'Value'],
      dtype='object')

In [69]:
df3['first_name'].isnull().sum()

0

In [70]:
df3['last_name'].isnull().sum()

29

In [71]:
df3['gender'].isnull().sum()

0

In [72]:
df3['gender'].value_counts()

Female    513
Male      470
U          17
Name: gender, dtype: int64

In [73]:
df3['gender'] = df3['gender'].replace('U', 'Unspecified')

In [74]:
df3['gender'].value_counts()

Female         513
Male           470
Unspecified     17
Name: gender, dtype: int64

In [78]:
df3['DOB'] = pd.to_datetime(df3['DOB'])

In [81]:
a  = df3['DOB'].dtype

In [82]:
print(a)

datetime64[ns]

In [83]:
df3['DOB'].value_counts()

1998-05-02    2
1978-01-15    2
1977-08-11    2
1951-11-28    2
1979-07-28    2
             ..
1945-08-08    1
1943-08-27    1
1999-10-24    1
1976-01-24    1
1955-02-10    1
Name: DOB, Length: 958, dtype: int64

In [89]:
df3['DOB'].isnull().sum()

17

In [91]:
df3['DOB'] = df3['DOB'].fillna('not recorded')

In [92]:
df3['DOB'].isnull().sum()

0

In [93]:
df3.columns

Index(['first_name', 'last_name', 'gender',
       'past_3_years_bike_related_purchases', 'DOB', 'job_title',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'owns_car', 'tenure', 'address', 'postcode', 'state', 'country',
       'property_valuation', 'Unnamed: 16', 'Unnamed: 17', 'Unnamed: 18',
       'Unnamed: 19', 'Unnamed: 20', 'Rank', 'Value'],
      dtype='object')

In [95]:
df3['past_3_years_bike_related_purchases'].isnull().sum()

0

In [97]:
df3['past_3_years_bike_related_purchases'].value_counts()

60    20
59    18
42    17
70    17
11    16
      ..
19     5
9      5
92     5
85     4
20     3
Name: past_3_years_bike_related_purchases, Length: 100, dtype: int64

In [99]:
df3['job_title'].isnull().sum()

106

In [100]:
df3['job_title'] = df3['job_title'].fillna('not recorded')

In [101]:
df3['job_title'].isnull().sum()

0

In [103]:
df3['job_industry_category'].isnull().sum()

165

In [104]:
df3['job_industry_category'].value_counts()

Financial Services    203
Manufacturing         199
Health                152
Retail                 78
Property               64
IT                     51
Entertainment          37
Argiculture            26
Telecommunications     25
Name: job_industry_category, dtype: int64

In [105]:
df3['job_industry_category'] = df3['job_industry_category'].replace('Argiculture', 'Agriculture')

In [106]:
df3['job_industry_category'].value_counts()

Financial Services    203
Manufacturing         199
Health                152
Retail                 78
Property               64
IT                     51
Entertainment          37
Agriculture            26
Telecommunications     25
Name: job_industry_category, dtype: int64

In [109]:
df3['wealth_segment'].isnull().sum()

0

In [110]:
df3['wealth_segment'].value_counts()

Mass Customer        508
High Net Worth       251
Affluent Customer    241
Name: wealth_segment, dtype: int64

In [112]:
df3['deceased_indicator'].isnull().sum()

0

In [113]:
df3['deceased_indicator'].value_counts()

N    1000
Name: deceased_indicator, dtype: int64

In [114]:
df3['deceased_indicator'] = df3['deceased_indicator'].replace('N', 'Non Deceased')

In [115]:
df3['deceased_indicator'].value_counts()

Non Deceased    1000
Name: deceased_indicator, dtype: int64

In [118]:
df3['owns_car'].isnull().sum()

0

In [119]:
df3['owns_car'].value_counts()

No     507
Yes    493
Name: owns_car, dtype: int64

In [121]:

df3['tenure'].isnull().sum()

0

In [122]:
df3['tenure'].value_counts()

9     79
13    74
11    68
10    63
12    61
5     60
7     60
17    59
15    58
8     55
14    54
16    49
6     45
4     36
18    36
19    34
3     26
21    24
20    22
2     15
22    12
1      8
0      2
Name: tenure, dtype: int64

In [124]:
df3['address'].isnull().sum()

0

In [126]:
df3['address'].nunique()

1000

In [127]:
df3['address'].duplicated().sum()

0

In [128]:
df3['postcode'].isnull().sum()

0

In [130]:
df3['postcode'].value_counts()

2145    9
2232    9
2750    7
3977    7
2148    7
       ..
2576    1
2479    1
3065    1
2762    1
4215    1
Name: postcode, Length: 522, dtype: int64

In [132]:
df3['state']

0      QLD
1      NSW
2      VIC
3      QLD
4      NSW
      ...
995    NSW
996    NSW
997    QLD
998    QLD
999    NSW
Name: state, Length: 1000, dtype: object

In [133]:
df3['state'].value_counts()

NSW    506
VIC    266
QLD    228
Name: state, dtype: int64